# Практическое задание по теме "Динамическая типизация"

# Создайте переменную name и присвойте ей значение вашего имени (строка).
name = 'Сергей'

# Выведите значение переменной name на экран.
print(f'Name: {name}')

# Создайте переменную age и присвойте ей значение вашего возраста (целое число).
age = 39

# Выведите значение переменной age на экран.
print(f'Age {age}')

# Перезапишите в age текущее значение переменной age + новое.
age += 1

# Выведите измененное значение переменной age на экран.
print(f'New Age: {age}')

# Создайте переменную is_student и присвойте ей значение True (логическое значение).
is_student = True

# Выведите значение переменной is_student на экран.
print(f'Is Student: {is_student}')