# Практическое задание по теме "Переменные"

# Количество выполненных ДЗ
tasks_completed = 12

# Количество затраченных часов
hours_spent = 1.5

# Название курса
course_name = 'Python'

# Время на одно задание
time_per_task = hours_spent / tasks_completed

# Выведите в консоль, используя переменные, следующую строку:
# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.
print(f'Курс: {course_name}, всего задач: {tasks_completed}, затрачено часов: {hours_spent}, '
      f'среднее время выполнения: {time_per_task} часа')
