# Практическое задание по теме "Строки и индексация строк"

# В переменную example запишите любую строку.
example = 'Python'

# Выведите в консоль первый символ этой строки.
print(example[0])

# Выведите в консоль последний символ этой строки.
print(example[-1])

# Выведите в консоль вторую половину этой строки.
print(example[(len(example)//2):])

# Выведите в консоль это слово наоборот.
print(example[::-1])

# Выведите в консоль каждый второй символ этой строки.
print(example[1::2])
